balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/16xxxx/PIC16F720.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="INTCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000u" edc:name="INTCON" edc:nzwidth="0x8" edc:por="0000000x">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RABIF" edc:desc="" edc:mask="0x1" edc:name="RABIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INTF" edc:desc="" edc:mask="0x1" edc:name="INTF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0IF" edc:desc="" edc:mask="0x1" edc:name="TMR0IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RABIE" edc:desc="" edc:mask="0x1" edc:name="RABIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INTE" edc:desc="" edc:mask="0x1" edc:name="INTE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0IE" edc:desc="" edc:mask="0x1" edc:name="TMR0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEIE" edc:desc="" edc:mask="0x1" edc:name="PEIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GIE" edc:desc="" edc:mask="0x1" edc:name="GIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnrrnnnn" edc:cname="PIR1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1IF" edc:desc="" edc:mask="0x1" edc:name="TMR1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR2IF" edc:desc="" edc:mask="0x1" edc:name="TMR2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1IF" edc:desc="" edc:mask="0x1" edc:name="CCP1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPIF" edc:desc="" edc:mask="0x1" edc:name="SSPIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXIF" edc:desc="" edc:mask="0x1" edc:name="TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RCIF" edc:desc="" edc:mask="0x1" edc:name="RCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADIF" edc:desc="" edc:mask="0x1" edc:name="ADIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1GIF" edc:desc="" edc:mask="0x1" edc:name="TMR1GIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TMR1IF" edc:desc="" edc:mask="0x1" edc:name="TMR1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR2IF" edc:desc="" edc:mask="0x1" edc:name="TMR2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1IF" edc:desc="" edc:mask="0x1" edc:name="CCP1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPIF" edc:desc="" edc:mask="0x1" edc:name="SSPIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ADIF" edc:desc="" edc:mask="0x1" edc:name="ADIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSPIF" edc:desc="" edc:mask="0x1" edc:name="PSPIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:JoinedSFRDef edc:cname="TMR1" edc:desc="" edc:name="TMR1" edc:nzwidth="0x10">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="TMR1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR1L" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR1L" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TMR1L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR1H" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR1H" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TMR1H" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnn-n-n" edc:cname="T1CON" edc:desc="" edc:impl="0xfd" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuu-u-u" edc:name="T1CON" edc:nzwidth="0x8" edc:por="0000-0-0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1ON" edc:desc="" edc:mask="0x1" edc:name="TMR1ON" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:desc="Enables Timer1" edc:when="(field &amp; 0x1) == 0x1"/>
                <edc:SFRFieldSemantic edc:desc="Disables Timer1" edc:when="(field &amp; 0x1) == 0x0"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T1SYNC" edc:desc="" edc:mask="0x1" edc:name="T1SYNC" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:desc="Do not synchronize external clock input" edc:when="(field &amp; 0x1) == 0x1"/>
                <edc:SFRFieldSemantic edc:desc="Synchronize external clock with system clock" edc:when="(field &amp; 0x1) == 0x0"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T1CKPS" edc:desc="" edc:mask="0x3" edc:name="T1CKPS" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:desc="1:8 prescale" edc:when="(field &amp; 0x3) == 0x3"/>
                <edc:SFRFieldSemantic edc:desc="1:4 prescale" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:desc="1:2 prescale" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:desc="1:1 prescale" edc:when="(field &amp; 0x3) == 0x0"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="TMR1CS" edc:desc="" edc:mask="0x3" edc:name="TMR1CS" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
                <edc:SFRFieldSemantic edc:desc="External Clock source from T1CKI pin on rising edge" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:desc="Clock source is FOSC" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:desc="Clock source is FOSC/4  instruction clock" edc:when="(field &amp; 0x3) == 0x0"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="nT1SYNC" edc:desc="" edc:mask="0x1" edc:name="nT1SYNC" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T1CKPS0" edc:desc="" edc:mask="0x1" edc:name="T1CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1CKPS1" edc:desc="" edc:mask="0x1" edc:name="T1CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR1CS0" edc:desc="" edc:mask="0x1" edc:name="TMR1CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR1CS1" edc:desc="" edc:mask="0x1" edc:name="TMR1CS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TMR2" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR2" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TMR2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="T2CON" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="T2CON" edc:nzwidth="0x8" edc:por="-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T2CKPS" edc:desc="" edc:mask="0x3" edc:name="T2CKPS" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:desc="1:1" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:desc="1:4" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:desc="1:16" edc:when="(field &amp; 0x2) == 0x2"/>
                <edc:SFRFieldSemantic edc:desc="" edc:when=""/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="TMR2ON" edc:desc="" edc:mask="0x1" edc:name="TMR2ON" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:desc="Timer2 on" edc:when="(field &amp; 0x1) == 0x1"/>
                <edc:SFRFieldSemantic edc:desc="Timer2 off" edc:when="(field &amp; 0x1) == 0x0"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="TOUTPS" edc:desc="" edc:mask="0xf" edc:name="TOUTPS" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:desc="1:1" edc:when="(field &amp; 0xf) == 0x0"/>
                <edc:SFRFieldSemantic edc:desc="1:2" edc:when="(field &amp; 0xf) == 0x1"/>
                <edc:SFRFieldSemantic edc:desc="1:3" edc:when="(field &amp; 0xf) == 0x2"/>
                <edc:SFRFieldSemantic edc:desc="1:4" edc:when="(field &amp; 0xf) == 0x3"/>
                <edc:SFRFieldSemantic edc:desc="1:5" edc:when="(field &amp; 0xf) == 0x4"/>
                <edc:SFRFieldSemantic edc:desc="1:6" edc:when="(field &amp; 0xf) == 0x5"/>
                <edc:SFRFieldSemantic edc:desc="1:7" edc:when="(field &amp; 0xf) == 0x6"/>
                <edc:SFRFieldSemantic edc:desc="1:8" edc:when="(field &amp; 0xf) == 0x7"/>
                <edc:SFRFieldSemantic edc:desc="1:9" edc:when="(field &amp; 0xf) == 0x8"/>
                <edc:SFRFieldSemantic edc:desc="1:10" edc:when="(field &amp; 0xf) == 0x9"/>
                <edc:SFRFieldSemantic edc:desc="1:11" edc:when="(field &amp; 0xf) == 0xa"/>
                <edc:SFRFieldSemantic edc:desc="1:12" edc:when="(field &amp; 0xf) == 0xb"/>
                <edc:SFRFieldSemantic edc:desc="1:13" edc:when="(field &amp; 0xf) == 0xc"/>
                <edc:SFRFieldSemantic edc:desc="1:14" edc:when="(field &amp; 0xf) == 0xd"/>
                <edc:SFRFieldSemantic edc:desc="1:15" edc:when="(field &amp; 0xf) == 0xe"/>
                <edc:SFRFieldSemantic edc:desc="1:16" edc:when="(field &amp; 0xf) == 0xf"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T2CKPS0" edc:desc="" edc:mask="0x1" edc:name="T2CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKPS1" edc:desc="" edc:mask="0x1" edc:name="T2CKPS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TOUTPS0" edc:desc="" edc:mask="0x1" edc:name="TOUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TOUTPS1" edc:desc="" edc:mask="0x1" edc:name="TOUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TOUTPS2" edc:desc="" edc:mask="0x1" edc:name="TOUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TOUTPS3" edc:desc="" edc:mask="0x1" edc:name="TOUTPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSPBUF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SSPBUF" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPBUF" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="SSPBUF" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSPCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSPCON" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPM" edc:desc="" edc:mask="0xf" edc:name="SSPM" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:desc="FOSC/4" edc:when="(field &amp; 0xf) == 0x0"/>
                <edc:SFRFieldSemantic edc:desc="FOSC/16" edc:when="(field &amp; 0xf) == 0x1"/>
                <edc:SFRFieldSemantic edc:desc="FOSC/64" edc:when="(field &amp; 0xf) == 0x2"/>
                <edc:SFRFieldSemantic edc:desc="TMR2 output/2" edc:when="(field &amp; 0xf) == 0x3"/>
                <edc:SFRFieldSemantic edc:desc="SCK pin and nSS pin enabled" edc:when="(field &amp; 0xf) == 0x4"/>
                <edc:SFRFieldSemantic edc:desc="SCK pin and nSS pin disabled and nSS used as I/O" edc:when="(field &amp; 0xf) == 0x5"/>
                <edc:SFRFieldSemantic edc:desc="I2C slave mode, 7 bit address" edc:when="(field &amp; 0xf) == 0x6"/>
                <edc:SFRFieldSemantic edc:desc="I2C slave mode, 10 bit address" edc:when="(field &amp; 0xf) == 0x7"/>
                <edc:SFRFieldSemantic edc:desc="Load SSPMSK at SSPADD" edc:when="(field &amp; 0xf) == 0x9"/>
                <edc:SFRFieldSemantic edc:desc="I2C master mode, slave IDLE" edc:when="(field &amp; 0xf) == 0xb"/>
                <edc:SFRFieldSemantic edc:desc="I2C slave mode 7 bit address w/start-stop interrupts enabled" edc:when="(field &amp; 0xf) == 0xe"/>
                <edc:SFRFieldSemantic edc:desc="I2C slave mode 10bit address w/start-stop interrupts disabled" edc:when="(field &amp; 0xf) == 0xf"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="CKP" edc:desc="" edc:mask="0x1" edc:name="CKP" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:desc="" edc:when="(field &amp; 0x1) == 0x1"/>
                <edc:SFRFieldSemantic edc:desc="" edc:when="(field &amp; 0x1) == 0x0"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="SSPEN" edc:desc="" edc:mask="0x1" edc:name="SSPEN" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:desc="Enable" edc:when="(field &amp; 0x1) == 0x1"/>
                <edc:SFRFieldSemantic edc:desc="Disable" edc:when="(field &amp; 0x1) == 0x0"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="SSPOV" edc:desc="" edc:mask="0x1" edc:name="SSPOV" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:desc="" edc:when="(field &amp; 0x1) == 0x1"/>
                <edc:SFRFieldSemantic edc:desc="" edc:when="(field &amp; 0x1) == 0x0"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="WCOL" edc:desc="" edc:mask="0x1" edc:name="WCOL" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:desc="SSPBUF is writting while transmitting previous word" edc:when="(field &amp; 0x1) == 0x1"/>
                <edc:SFRFieldSemantic edc:desc="No collision" edc:when="(field &amp; 0x1) == 0x0"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SSPM0" edc:desc="" edc:mask="0x1" edc:name="SSPM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPM1" edc:desc="" edc:mask="0x1" edc:name="SSPM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPM2" edc:desc="" edc:mask="0x1" edc:name="SSPM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPM3" edc:desc="" edc:mask="0x1" edc:name="SSPM3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
